{
  "reviews": [
    {
      "id": "1",
      "product_id": "flon-shea-butter",
      "user_id": "user-1",
      "user_name": "John Doe",
      "rating": 5,
      "title": "Excellent Shea Butter!",
      "review_body": "This shea butter is absolutely amazing! The quality is outstanding and it works perfectly for my skin. Highly recommend!",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-01-15T10:30:00Z",
      "updated_at": "2024-01-15T10:30:00Z",
      "helpful_count": 3
    },
    {
      "id": "2",
      "product_id": "flon-shea-butter",
      "user_id": "user-2",
      "user_name": "Jane Smith",
      "rating": 4,
      "title": "Great Natural Product",
      "review_body": "Good quality natural shea butter at a reasonable price. Delivery was fast and the product arrived in perfect condition.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-01-20T14:45:00Z",
      "updated_at": "2024-01-20T14:45:00Z",
      "helpful_count": 1
    },
    {
      "id": "3",
      "product_id": "flon-shea-butter",
      "user_id": "user-3",
      "user_name": "Mike Johnson",
      "rating": 3,
      "title": "Decent Shea Butter",
      "review_body": "The shea butter is okay, but there are some minor issues. It works as expected but could be better.",
      "status": "pending",
      "is_verified_purchase": false,
      "created_at": "2024-01-25T09:15:00Z",
      "updated_at": "2024-01-25T09:15:00Z",
      "helpful_count": 0
    },
    {
      "id": "4",
      "product_id": "eco-body-gift-set",
      "user_id": "user-4",
      "user_name": "Sarah Wilson",
      "rating": 5,
      "title": "Amazing Gift Set!",
      "review_body": "I love this eco-friendly body care set! The quality is exceptional and it has exceeded all my expectations.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-01-10T16:20:00Z",
      "updated_at": "2024-01-10T16:20:00Z",
      "helpful_count": 5
    },
    {
      "id": "5",
      "product_id": "flon-insulated-water-bottle",
      "user_id": "user-5",
      "user_name": "David Brown",
      "rating": 4,
      "title": "Good Water Bottle",
      "review_body": "Solid insulated water bottle with good quality. Keeps drinks cold for hours. Would recommend to others.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-01-12T11:30:00Z",
      "updated_at": "2024-01-12T11:30:00Z",
      "helpful_count": 2
    },
    {
      "id": "6",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-n-1755297905553",
      "user_name": "n",
      "rating": 5,
      "title": "",
      "review_body": "Safest for you, the planet and the silkworm too! Without doubt the best dental floss I’ve ever used I never thought about it previously when using plastic based floss - but such plastics are obviously bad for the body and the environment. Without doubt the best dental floss I’ve ever used I never thought about it previously when using plastic based floss - but such plastics are obviously bad for the body and the environment. This silk floss however is PLASTIC FREE - and produced ethically without harming the silkworms. Made of Organic Ahimsa (Peace) Silk - a totally Natural Dental Silk thread Eco friendly,Biodegradable and Compostable. This is a sustainable Zero Waste, Natural Way to Clean your teeth. I’m delighted with it, it’s far stronger than I was led to believe from other reviews and quite honestly the slight roughness to the thread means it’s far more effective at removing plaque etc. my teeth feel amazing! I will never go back to plastic floss or buy silk that is not Ahimsa (a method that is friendly to the silk worms ….. you need to know this as silk products that are not Ahimsa are not friendly toward silk worms (non-ahimsa methods involve boiling the silk worms which is of course disgusting…. Whereas this ahimsa silk allows the silk worms to flourish and live a happy life).",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-04-12T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.714Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "7",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-dgilbert-1755297905554",
      "user_name": "D. Gilbert",
      "rating": 5,
      "title": "",
      "review_body": "Does better job than plastic floss I have used this for a couple of years and my gums hate it when I run out - this floss is far superior at removing caught up bits of food than the traditional plastic floss. I have used this for a couple of years and my gums hate it when I run out - this floss is far superior at removing caught up bits of food than the traditional plastic floss. It is less smooth so it catches more. It will sometimes break when flossing, being a natural material, but it's well worth it. My gums love it and even my dentist wanted to know what I am using to get such good results.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-12-02T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "8",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-amazoncustomer-1755297905554",
      "user_name": "Amazon Customer",
      "rating": 4,
      "title": "",
      "review_body": "it takes time to change habits If you are expecting the same experience as with your standard dental floss, you might be disappointed. If you are expecting the same experience as with your standard dental floss, you might be disappointed. This is not to say that it is way worse, but it is just different. The floss doesn't have the same texture - at times it feels like flossing your teeth with slightly thicker thread. The good thing about it is that it doesn't snap so easily, but I couldn't feel any peppermint. Oh, and don't be mislead by the picture - the packaging is tiny. On the good note is that it comes in a glass jar and is more environmentally friendly",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-10T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "9",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-ct-1755297905554",
      "user_name": "CT",
      "rating": 5,
      "title": "",
      "review_body": "Recommend Good quality product. Good quality product. It does not snap while flossing. Will buy it again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-05-25T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "10",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-irisb-1755297905554",
      "user_name": "Iris B.",
      "rating": 5,
      "title": "",
      "review_body": "Ideal refills and super flossing My absolute favourite go-to floss. My absolute favourite go-to floss. Have a nice wooden container so refills are ideal",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-03-10T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "11",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-pc-1755297905554",
      "user_name": "pc",
      "rating": 5,
      "title": "",
      "review_body": "works for me For me, this floss is the perfect thickness. For me, this floss is the perfect thickness. It is strong and does not fray. There is no flavour, which is no bad thing. Happy that it is relatively more environmentally friendly than most other flosses. Could be improved by providing an option for a glass dispenser, but I am just as happy to do without one. Less is more. I would buy it again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-12-05T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "12",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-melodiehyams-1755297905554",
      "user_name": "Melodie Hyams",
      "rating": 4,
      "title": "",
      "review_body": "Almost perfect eco floss I decided to try eco floss to reduce my personal plastic 'footprint'. I decided to try eco floss to reduce my personal plastic 'footprint'. I've been using FLON for over a year now. It's good but just a little more breakable than standard (non-eco) floss and not as 'silky' as I would like. Having said that, there is always one area of my mouth where it breaks, due to a tight squeeze and a sharpish tooth, so that may not be an issue for others. I'd prefer a little more pepermint taste, there's very little, if any. For perfection, an indication of where to cut it for the ideal length would be useful. I often feel I've been excessive but it's quite difficult to judge, so I err on too much which is not ideal for my waste reduction aspirations! I've decided to have a whirl with the EcoYou Bamboo Charcoal Dental Floss. I don't really like the idea of black floss but if it's less breakable that would be preferable. So those are the pros and cons from my perspective. In spite of the quibbles, I would still recommend it. You really just need to try it for yourself...",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2023-08-28T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "13",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-fh-1755297905554",
      "user_name": "F H.",
      "rating": 4,
      "title": "",
      "review_body": "Good Good although too pricey. Good although too pricey. Much more effective than other standard flossing it doesn't shred your gums more gentle.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-07-28T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "14",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-crowolf-1755297905555",
      "user_name": "Crowolf",
      "rating": 5,
      "title": "",
      "review_body": "This doesn't break between your teeth. Unlike other well-known and more expensive makes of fluoride free dental floss this does not snap off between your teeth and if like me you have teeth that are close together finding a floss that doesn't break can turn into an online quest. Unlike other well-known and more expensive makes of fluoride free dental floss this does not snap off between your teeth and if like me you have teeth that are close together finding a floss that doesn't break can turn into an online quest. As this dental floss is made out of silk it slides between the teeth with comfort and has a nice taste to it too. The silk is harvested humanely and to me seems the best medium for the job.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-12-02T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "15",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-andrewandandrewswife-1755297905555",
      "user_name": "Andrew and Andrew's Wife",
      "rating": 5,
      "title": "",
      "review_body": "Does the job it is designed for. I have teeth that are very close together but this gets between them and flosses well. I have teeth that are very close together but this gets between them and flosses well. You need to pull a fair amount off and warp around your fingers and be gentle as you floss but if you get the knack of it, one strand will work for the whole mouth. I will be buying this product regularly from now on.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2023-07-12T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "16",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-lou-1755297905555",
      "user_name": "Lou",
      "rating": 5,
      "title": "",
      "review_body": "Great. Been using these for years, they are great and do the job. Been using these for years, they are great and do the job.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-06-15T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "17",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-kittycat-1755297905555",
      "user_name": "KittyCat",
      "rating": 5,
      "title": "",
      "review_body": "Excellent eco floss! I never thought about an ‘eco’ dental floss until I saw them on here - I’m so glad I bought it! I never thought about an ‘eco’ dental floss until I saw them on here - I’m so glad I bought it! After looking at other brands which weren’t 100% biodegradable, this brand seemed to be a lot better and honest (from what I’ve read...). The floss worked a lot better than I thought and didn’t break off while flossing. Didn’t even break when flossing awkward back teeth. Definitely recommend and I love that there are refills. So much better for the ocean and planet! The glass jar is small, so easy to store too.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-25T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "18",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-stephl-1755297905555",
      "user_name": "Steph L",
      "rating": 5,
      "title": "",
      "review_body": "Great quality floss I recently ordered this product to see what it was like as I am trying to limit the amount of single use plastic I use. I recently ordered this product to see what it was like as I am trying to limit the amount of single use plastic I use. The mint flavour is quite subtle, which I like, and it the floss itself is much stronger than the previous eco-friendly flosses I have used with no breakage when getting those back teeth! Delivery was pretty quick given the current Covid delays and the packaging is really cute. I will definitely order again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-05-10T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "19",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-jocelyn-1755297905555",
      "user_name": "Jocelyn",
      "rating": 5,
      "title": "",
      "review_body": "works well very smooth and easy to use , easy to open also very smooth and easy to use , easy to open also",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-01-25T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "20",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-kf-1755297905556",
      "user_name": "Kf",
      "rating": 5,
      "title": "",
      "review_body": "Great value Very impressed with this, both for value and quality. Very impressed with this, both for value and quality. Always buy this.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2023-09-09T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "21",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-ssayers-1755297905556",
      "user_name": "S Sayers",
      "rating": 4,
      "title": "",
      "review_body": "Comfortable to use but prone to breaking Comfortable to use but prone to breaking",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-22T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "22",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-eleanorharrison-1755297905556",
      "user_name": "Eleanor Harrison",
      "rating": 5,
      "title": "",
      "review_body": "Eco dental floss.....does what it says on the tin! Very nice product - arrived quickly. Very nice product - arrived quickly. I wasn't totally sure if the cutting mechanism would work as I tried one before that was rubbish - but this one works a treat. Really happy to have replaced another bit of bathroom plastic with an eco version. thanks!!",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-05-03T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "23",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-amazoncustomer-1755297905556",
      "user_name": "Amazon Customer",
      "rating": 5,
      "title": "",
      "review_body": "It's good product It's really good. It's really good. Bit expensive but quality is good.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-11-21T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "24",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-cleocheong-1755297905556",
      "user_name": "Cleo Cheong",
      "rating": 5,
      "title": "",
      "review_body": "Smells fresh, cleans well. Arrived within 3 days and delivered by Royal mail. Arrived within 3 days and delivered by Royal mail. Love the peppermint oil flavour - smells fresh! But most importantly the floss cleans well. The thread is not too thin nor too thick, just perfect. Customer image Customer image",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-10-28T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "25",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-birdy-1755297905556",
      "user_name": "Birdy",
      "rating": 5,
      "title": "",
      "review_body": "Lovely 👍🏼 My teeth are very close together, yet this waxed floss gets to all the tricky places. My teeth are very close together, yet this waxed floss gets to all the tricky places. It’s also minty, so leaves a fresh flavour in the mouth. Pleasantly surprised.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-11T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "26",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-judyc-1755297905556",
      "user_name": "judyc",
      "rating": 5,
      "title": "",
      "review_body": "I can’t believe it’s not plastic Very strong yet gentle floss. Very strong yet gentle floss. Doesn’t shred like another plastic free floss I tried. Thicker than my previous alternative too yet glides more easily between very tight teeth.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-01-20T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "27",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-sarainhove-1755297905556",
      "user_name": "sarainhove",
      "rating": 5,
      "title": "",
      "review_body": "Less plastic I will keep buying this. I will keep buying this. Doesn't fray or break easy and the fewer plastic boxes i have to throw away the better.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-05-25T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "28",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-amybowen-1755297905556",
      "user_name": "Amy Bowen",
      "rating": 5,
      "title": "",
      "review_body": "Great product Lovely dental floss, has a nice feel and scent to it. Lovely dental floss, has a nice feel and scent to it. Love the glass bottle it comes in too. Would buy again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-16T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "29",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-lynseymcinnes-1755297905557",
      "user_name": "Lynsey McInnes",
      "rating": 5,
      "title": "",
      "review_body": "Delicious and sustainable. Yay! Loved my new floss from Flon. Loved my new floss from Flon. Cute and sustainable packaging, smelt and tasted delicious and did the job well. I'll definitely be buying again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-11-06T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "30",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-reportpage5bdw-1755297905557",
      "user_name": "Report page 5:\tBDW",
      "rating": 5,
      "title": "",
      "review_body": "Does the job Doesn’t break as easily as some other natural fibre floss - or I’ve learnt how to use them now! Doesn’t break as easily as some other natural fibre floss - or I’ve learnt how to use them now!",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-08-24T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "31",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-judith-1755297905557",
      "user_name": "Judith",
      "rating": 5,
      "title": "",
      "review_body": "Will buy again Doesn't snap like other brands. Doesn't snap like other brands. Eco packaging and easy refill",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-03-18T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "32",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-poppets-1755297905557",
      "user_name": "Poppets",
      "rating": 5,
      "title": "",
      "review_body": "Good buy. Ideal product. Ideal product. Very nice to use.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-07-10T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "33",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-jlbaxter-1755297905557",
      "user_name": "J L Baxter",
      "rating": 5,
      "title": "",
      "review_body": "Great floss Great. Great. Easy to floss with this product.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-01-10T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "34",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-lukevandenhoven-1755297905557",
      "user_name": "Luke van den Hoven",
      "rating": 4,
      "title": "",
      "review_body": "Great alternative Easy to use floss, seems to do the job. Easy to use floss, seems to do the job. Like many other eco floss it does snap quite easily.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-03T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "35",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-jess-1755297905557",
      "user_name": "Jess",
      "rating": 5,
      "title": "",
      "review_body": "Best ecofriendly floss! Very happy!! Very happy!! 😀 We have tried a few ecofriendly floss without success until now, this is the best one. It goes between the teeth easily. I will definitely buy it again!!! Report page 6:From United Kingdom",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-09-02T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "36",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-ab-1755297905557",
      "user_name": "AB",
      "rating": 5,
      "title": "",
      "review_body": "Would buy again Over all a great product. Over all a great product. Rips easily, but that's only a small problem. Most important is, that it's eco friendly and I don't have to change my dental hygiene routine.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-10-10T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "37",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-lenalo-1755297905557",
      "user_name": "Lena Lo",
      "rating": 5,
      "title": "",
      "review_body": "Plastic free floss that doesn't break - and doesn't break the bank! I am trying to reduce my plastic waste and came across this brilliant little product: floss made out of (ethically sourced) silk in a cute glass container. I am trying to reduce my plastic waste and came across this brilliant little product: floss made out of (ethically sourced) silk in a cute glass container. I was a bit worried at first whether it would have the same strength as standard plastic floss, but am glad to say that it's standing up very well to my rigorous flossing. The texture of the floss is a bit uneven but I think this actually helps its purpose. I found getting the first bit of floss through the cutting mechanism a bit fiddly but haven't had any issues since then. It's cute, it's functional, it's ethical and it's well-priced.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-11-16T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "38",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-lenjane-1755297905557",
      "user_name": "Lenjane",
      "rating": 5,
      "title": "",
      "review_body": "Great Eco slyrrnstive Good value eco product to cut down in plastic floss From other countries Good value eco product to cut down in plastic floss From other countries",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-09-05T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "39",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-mircolami-1755297905557",
      "user_name": "Mirco Lami",
      "rating": 5,
      "title": "",
      "review_body": "Recensione filo [Translated] Excellent floss; good abrasion resistance; doesn’t break even when reused. [Translated] Excellent floss; good abrasion resistance; doesn’t break even when reused.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-01-26T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "40",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-amel-1755297905557",
      "user_name": "Amel",
      "rating": 5,
      "title": "",
      "review_body": "Parfait [Translated] Perfect. [Translated] Perfect.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-06-21T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "41",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-josephinelegrand-1755297905557",
      "user_name": "Josephine Legrand",
      "rating": 4,
      "title": "",
      "review_body": "Bonne alternative écologique à un fil dentaire comme Reach par Johnson [Translated] I adopted this floss to reduce plastic waste; quality similar to my usual; looks nice; minor issue: end of thread slips back into the bottle. [Translated] I adopted this floss to reduce plastic waste; quality similar to my usual; looks nice; minor issue: end of thread slips back into the bottle.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-08-31T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "42",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-josephinelegrand-1755297905557",
      "user_name": "Josephine Legrand",
      "rating": 5,
      "title": "",
      "review_body": "Pratique, joli et écolo [Translated] Works as well or better than standard floss; compact and pretty glass bottle. [Translated] Works as well or better than standard floss; compact and pretty glass bottle. This is the refill.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-05-11T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "43",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-n-1755298687796",
      "user_name": "n",
      "rating": 5,
      "title": "",
      "review_body": "Safest for you, the planet and the silkworm too! Without doubt the best dental floss I’ve ever used I never thought about it previously when using plastic based floss - but such plastics are obviously bad for the body and the environment. Without doubt the best dental floss I’ve ever used I never thought about it previously when using plastic based floss - but such plastics are obviously bad for the body and the environment. This silk floss however is PLASTIC FREE - and produced ethically without harming the silkworms. Made of Organic Ahimsa (Peace) Silk - a totally Natural Dental Silk thread Eco friendly,Biodegradable and Compostable. This is a sustainable Zero Waste, Natural Way to Clean your teeth. I’m delighted with it, it’s far stronger than I was led to believe from other reviews and quite honestly the slight roughness to the thread means it’s far more effective at removing plaque etc. my teeth feel amazing! I will never go back to plastic floss or buy silk that is not Ahimsa (a method that is friendly to the silk worms ….. you need to know this as silk products that are not Ahimsa are not friendly toward silk worms (non-ahimsa methods involve boiling the silk worms which is of course disgusting…. Whereas this ahimsa silk allows the silk worms to flourish and live a happy life).",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-04-12T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "44",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-dgilbert-1755298687796",
      "user_name": "D. Gilbert",
      "rating": 5,
      "title": "",
      "review_body": "Does better job than plastic floss I have used this for a couple of years and my gums hate it when I run out - this floss is far superior at removing caught up bits of food than the traditional plastic floss. I have used this for a couple of years and my gums hate it when I run out - this floss is far superior at removing caught up bits of food than the traditional plastic floss. It is less smooth so it catches more. It will sometimes break when flossing, being a natural material, but it's well worth it. My gums love it and even my dentist wanted to know what I am using to get such good results.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-12-02T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "45",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-amazoncustomer-1755298687797",
      "user_name": "Amazon Customer",
      "rating": 4,
      "title": "",
      "review_body": "it takes time to change habits If you are expecting the same experience as with your standard dental floss, you might be disappointed. If you are expecting the same experience as with your standard dental floss, you might be disappointed. This is not to say that it is way worse, but it is just different. The floss doesn't have the same texture - at times it feels like flossing your teeth with slightly thicker thread. The good thing about it is that it doesn't snap so easily, but I couldn't feel any peppermint. Oh, and don't be mislead by the picture - the packaging is tiny. On the good note is that it comes in a glass jar and is more environmentally friendly",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-10T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "46",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-ct-1755298687797",
      "user_name": "CT",
      "rating": 5,
      "title": "",
      "review_body": "Recommend Good quality product. Good quality product. It does not snap while flossing. Will buy it again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-05-25T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "47",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-irisb-1755298687797",
      "user_name": "Iris B.",
      "rating": 5,
      "title": "",
      "review_body": "Ideal refills and super flossing My absolute favourite go-to floss. My absolute favourite go-to floss. Have a nice wooden container so refills are ideal",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-03-10T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "48",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-pc-1755298687797",
      "user_name": "pc",
      "rating": 5,
      "title": "",
      "review_body": "works for me For me, this floss is the perfect thickness. For me, this floss is the perfect thickness. It is strong and does not fray. There is no flavour, which is no bad thing. Happy that it is relatively more environmentally friendly than most other flosses. Could be improved by providing an option for a glass dispenser, but I am just as happy to do without one. Less is more. I would buy it again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-12-05T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "49",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-melodiehyams-1755298687797",
      "user_name": "Melodie Hyams",
      "rating": 4,
      "title": "",
      "review_body": "Almost perfect eco floss I decided to try eco floss to reduce my personal plastic 'footprint'. I decided to try eco floss to reduce my personal plastic 'footprint'. I've been using FLON for over a year now. It's good but just a little more breakable than standard (non-eco) floss and not as 'silky' as I would like. Having said that, there is always one area of my mouth where it breaks, due to a tight squeeze and a sharpish tooth, so that may not be an issue for others. I'd prefer a little more pepermint taste, there's very little, if any. For perfection, an indication of where to cut it for the ideal length would be useful. I often feel I've been excessive but it's quite difficult to judge, so I err on too much which is not ideal for my waste reduction aspirations! I've decided to have a whirl with the EcoYou Bamboo Charcoal Dental Floss. I don't really like the idea of black floss but if it's less breakable that would be preferable. So those are the pros and cons from my perspective. In spite of the quibbles, I would still recommend it. You really just need to try it for yourself...",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2023-08-28T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "50",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-fh-1755298687797",
      "user_name": "F H.",
      "rating": 4,
      "title": "",
      "review_body": "Good Good although too pricey. Good although too pricey. Much more effective than other standard flossing it doesn't shred your gums more gentle.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-07-28T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "51",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-crowolf-1755298687797",
      "user_name": "Crowolf",
      "rating": 5,
      "title": "",
      "review_body": "This doesn't break between your teeth. Unlike other well-known and more expensive makes of fluoride free dental floss this does not snap off between your teeth and if like me you have teeth that are close together finding a floss that doesn't break can turn into an online quest. Unlike other well-known and more expensive makes of fluoride free dental floss this does not snap off between your teeth and if like me you have teeth that are close together finding a floss that doesn't break can turn into an online quest. As this dental floss is made out of silk it slides between the teeth with comfort and has a nice taste to it too. The silk is harvested humanely and to me seems the best medium for the job.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-12-02T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "52",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-andrewandandrewswife-1755298687797",
      "user_name": "Andrew and Andrew's Wife",
      "rating": 5,
      "title": "",
      "review_body": "Does the job it is designed for. I have teeth that are very close together but this gets between them and flosses well. I have teeth that are very close together but this gets between them and flosses well. You need to pull a fair amount off and warp around your fingers and be gentle as you floss but if you get the knack of it, one strand will work for the whole mouth. I will be buying this product regularly from now on.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2023-07-12T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "53",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-lou-1755298687798",
      "user_name": "Lou",
      "rating": 5,
      "title": "",
      "review_body": "Great. Been using these for years, they are great and do the job. Been using these for years, they are great and do the job.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-06-15T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "54",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-kittycat-1755298687798",
      "user_name": "KittyCat",
      "rating": 5,
      "title": "",
      "review_body": "Excellent eco floss! I never thought about an ‘eco’ dental floss until I saw them on here - I’m so glad I bought it! I never thought about an ‘eco’ dental floss until I saw them on here - I’m so glad I bought it! After looking at other brands which weren’t 100% biodegradable, this brand seemed to be a lot better and honest (from what I’ve read...). The floss worked a lot better than I thought and didn’t break off while flossing. Didn’t even break when flossing awkward back teeth. Definitely recommend and I love that there are refills. So much better for the ocean and planet! The glass jar is small, so easy to store too.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-25T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "55",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-stephl-1755298687798",
      "user_name": "Steph L",
      "rating": 5,
      "title": "",
      "review_body": "Great quality floss I recently ordered this product to see what it was like as I am trying to limit the amount of single use plastic I use. I recently ordered this product to see what it was like as I am trying to limit the amount of single use plastic I use. The mint flavour is quite subtle, which I like, and it the floss itself is much stronger than the previous eco-friendly flosses I have used with no breakage when getting those back teeth! Delivery was pretty quick given the current Covid delays and the packaging is really cute. I will definitely order again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-05-10T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "56",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-jocelyn-1755298687798",
      "user_name": "Jocelyn",
      "rating": 5,
      "title": "",
      "review_body": "works well very smooth and easy to use , easy to open also very smooth and easy to use , easy to open also",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-01-25T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "57",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-kf-1755298687798",
      "user_name": "Kf",
      "rating": 5,
      "title": "",
      "review_body": "Great value Very impressed with this, both for value and quality. Very impressed with this, both for value and quality. Always buy this.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2023-09-09T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "58",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-ssayers-1755298687799",
      "user_name": "S Sayers",
      "rating": 4,
      "title": "",
      "review_body": "Comfortable to use but prone to breaking Comfortable to use but prone to breaking",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-22T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "59",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-eleanorharrison-1755298687799",
      "user_name": "Eleanor Harrison",
      "rating": 5,
      "title": "",
      "review_body": "Eco dental floss.....does what it says on the tin! Very nice product - arrived quickly. Very nice product - arrived quickly. I wasn't totally sure if the cutting mechanism would work as I tried one before that was rubbish - but this one works a treat. Really happy to have replaced another bit of bathroom plastic with an eco version. thanks!!",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-05-03T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "60",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-amazoncustomer-1755298687799",
      "user_name": "Amazon Customer",
      "rating": 5,
      "title": "",
      "review_body": "It's good product It's really good. It's really good. Bit expensive but quality is good.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-11-21T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "61",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-cleocheong-1755298687799",
      "user_name": "Cleo Cheong",
      "rating": 5,
      "title": "",
      "review_body": "Smells fresh, cleans well. Arrived within 3 days and delivered by Royal mail. Arrived within 3 days and delivered by Royal mail. Love the peppermint oil flavour - smells fresh! But most importantly the floss cleans well. The thread is not too thin nor too thick, just perfect. Customer image Customer image",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-10-28T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "62",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-birdy-1755298687799",
      "user_name": "Birdy",
      "rating": 5,
      "title": "",
      "review_body": "Lovely 👍🏼 My teeth are very close together, yet this waxed floss gets to all the tricky places. My teeth are very close together, yet this waxed floss gets to all the tricky places. It’s also minty, so leaves a fresh flavour in the mouth. Pleasantly surprised.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-11T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "63",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-judyc-1755298687799",
      "user_name": "judyc",
      "rating": 5,
      "title": "",
      "review_body": "I can’t believe it’s not plastic Very strong yet gentle floss. Very strong yet gentle floss. Doesn’t shred like another plastic free floss I tried. Thicker than my previous alternative too yet glides more easily between very tight teeth.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-01-20T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "64",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-sarainhove-1755298687799",
      "user_name": "sarainhove",
      "rating": 5,
      "title": "",
      "review_body": "Less plastic I will keep buying this. I will keep buying this. Doesn't fray or break easy and the fewer plastic boxes i have to throw away the better.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-05-25T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "65",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-amybowen-1755298687799",
      "user_name": "Amy Bowen",
      "rating": 5,
      "title": "",
      "review_body": "Great product Lovely dental floss, has a nice feel and scent to it. Lovely dental floss, has a nice feel and scent to it. Love the glass bottle it comes in too. Would buy again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-16T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "66",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-lynseymcinnes-1755298687799",
      "user_name": "Lynsey McInnes",
      "rating": 5,
      "title": "",
      "review_body": "Delicious and sustainable. Yay! Loved my new floss from Flon. Loved my new floss from Flon. Cute and sustainable packaging, smelt and tasted delicious and did the job well. I'll definitely be buying again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-11-06T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "67",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-reportpage5bdw-1755298687799",
      "user_name": "Report page 5:\tBDW",
      "rating": 5,
      "title": "",
      "review_body": "Does the job Doesn’t break as easily as some other natural fibre floss - or I’ve learnt how to use them now! Doesn’t break as easily as some other natural fibre floss - or I’ve learnt how to use them now!",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-08-24T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "68",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-judith-1755298687800",
      "user_name": "Judith",
      "rating": 5,
      "title": "",
      "review_body": "Will buy again Doesn't snap like other brands. Doesn't snap like other brands. Eco packaging and easy refill",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-03-18T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "69",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-poppets-1755298687800",
      "user_name": "Poppets",
      "rating": 5,
      "title": "",
      "review_body": "Good buy. Ideal product. Ideal product. Very nice to use.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-07-10T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "70",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-jlbaxter-1755298687800",
      "user_name": "J L Baxter",
      "rating": 5,
      "title": "",
      "review_body": "Great floss Great. Great. Easy to floss with this product.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-01-10T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "71",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-lukevandenhoven-1755298687800",
      "user_name": "Luke van den Hoven",
      "rating": 4,
      "title": "",
      "review_body": "Great alternative Easy to use floss, seems to do the job. Easy to use floss, seems to do the job. Like many other eco floss it does snap quite easily.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-03T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "72",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-jess-1755298687800",
      "user_name": "Jess",
      "rating": 5,
      "title": "",
      "review_body": "Best ecofriendly floss! Very happy!! Very happy!! 😀 We have tried a few ecofriendly floss without success until now, this is the best one. It goes between the teeth easily. I will definitely buy it again!!! Report page 6:From United Kingdom",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-09-02T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "73",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-ab-1755298687800",
      "user_name": "AB",
      "rating": 5,
      "title": "",
      "review_body": "Would buy again Over all a great product. Over all a great product. Rips easily, but that's only a small problem. Most important is, that it's eco friendly and I don't have to change my dental hygiene routine.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-10-10T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "74",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-lenalo-1755298687800",
      "user_name": "Lena Lo",
      "rating": 5,
      "title": "",
      "review_body": "Plastic free floss that doesn't break - and doesn't break the bank! I am trying to reduce my plastic waste and came across this brilliant little product: floss made out of (ethically sourced) silk in a cute glass container. I am trying to reduce my plastic waste and came across this brilliant little product: floss made out of (ethically sourced) silk in a cute glass container. I was a bit worried at first whether it would have the same strength as standard plastic floss, but am glad to say that it's standing up very well to my rigorous flossing. The texture of the floss is a bit uneven but I think this actually helps its purpose. I found getting the first bit of floss through the cutting mechanism a bit fiddly but haven't had any issues since then. It's cute, it's functional, it's ethical and it's well-priced.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-11-16T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "75",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-lenjane-1755298687800",
      "user_name": "Lenjane",
      "rating": 5,
      "title": "",
      "review_body": "Great Eco slyrrnstive Good value eco product to cut down in plastic floss From other countries Good value eco product to cut down in plastic floss From other countries",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-09-05T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "76",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-mircolami-1755298687800",
      "user_name": "Mirco Lami",
      "rating": 5,
      "title": "",
      "review_body": "Recensione filo [Translated] Excellent floss; good abrasion resistance; doesn’t break even when reused. [Translated] Excellent floss; good abrasion resistance; doesn’t break even when reused.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-01-26T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "77",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-amel-1755298687800",
      "user_name": "Amel",
      "rating": 5,
      "title": "",
      "review_body": "Parfait [Translated] Perfect. [Translated] Perfect.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-06-21T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "78",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-josephinelegrand-1755298687800",
      "user_name": "Josephine Legrand",
      "rating": 4,
      "title": "",
      "review_body": "Bonne alternative écologique à un fil dentaire comme Reach par Johnson [Translated] I adopted this floss to reduce plastic waste; quality similar to my usual; looks nice; minor issue: end of thread slips back into the bottle. [Translated] I adopted this floss to reduce plastic waste; quality similar to my usual; looks nice; minor issue: end of thread slips back into the bottle.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-08-31T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "79",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-josephinelegrand-1755298687800",
      "user_name": "Josephine Legrand",
      "rating": 5,
      "title": "",
      "review_body": "Pratique, joli et écolo [Translated] Works as well or better than standard floss; compact and pretty glass bottle. [Translated] Works as well or better than standard floss; compact and pretty glass bottle. This is the refill.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-05-11T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "80",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-n-1755298723849",
      "user_name": "n",
      "rating": 5,
      "title": "",
      "review_body": "Safest for you, the planet and the silkworm too! Without doubt the best dental floss I’ve ever used I never thought about it previously when using plastic based floss - but such plastics are obviously bad for the body and the environment. Without doubt the best dental floss I’ve ever used I never thought about it previously when using plastic based floss - but such plastics are obviously bad for the body and the environment. This silk floss however is PLASTIC FREE - and produced ethically without harming the silkworms. Made of Organic Ahimsa (Peace) Silk - a totally Natural Dental Silk thread Eco friendly,Biodegradable and Compostable. This is a sustainable Zero Waste, Natural Way to Clean your teeth. I’m delighted with it, it’s far stronger than I was led to believe from other reviews and quite honestly the slight roughness to the thread means it’s far more effective at removing plaque etc. my teeth feel amazing! I will never go back to plastic floss or buy silk that is not Ahimsa (a method that is friendly to the silk worms ….. you need to know this as silk products that are not Ahimsa are not friendly toward silk worms (non-ahimsa methods involve boiling the silk worms which is of course disgusting…. Whereas this ahimsa silk allows the silk worms to flourish and live a happy life).",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-04-12T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "81",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-dgilbert-1755298723850",
      "user_name": "D. Gilbert",
      "rating": 5,
      "title": "",
      "review_body": "Does better job than plastic floss I have used this for a couple of years and my gums hate it when I run out - this floss is far superior at removing caught up bits of food than the traditional plastic floss. I have used this for a couple of years and my gums hate it when I run out - this floss is far superior at removing caught up bits of food than the traditional plastic floss. It is less smooth so it catches more. It will sometimes break when flossing, being a natural material, but it's well worth it. My gums love it and even my dentist wanted to know what I am using to get such good results.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-12-02T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "82",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-amazoncustomer-1755298723851",
      "user_name": "Amazon Customer",
      "rating": 4,
      "title": "",
      "review_body": "it takes time to change habits If you are expecting the same experience as with your standard dental floss, you might be disappointed. If you are expecting the same experience as with your standard dental floss, you might be disappointed. This is not to say that it is way worse, but it is just different. The floss doesn't have the same texture - at times it feels like flossing your teeth with slightly thicker thread. The good thing about it is that it doesn't snap so easily, but I couldn't feel any peppermint. Oh, and don't be mislead by the picture - the packaging is tiny. On the good note is that it comes in a glass jar and is more environmentally friendly",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-10T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "83",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-ct-1755298723851",
      "user_name": "CT",
      "rating": 5,
      "title": "",
      "review_body": "Recommend Good quality product. Good quality product. It does not snap while flossing. Will buy it again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-05-25T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "84",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-irisb-1755298723851",
      "user_name": "Iris B.",
      "rating": 5,
      "title": "",
      "review_body": "Ideal refills and super flossing My absolute favourite go-to floss. My absolute favourite go-to floss. Have a nice wooden container so refills are ideal",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-03-10T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "85",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-pc-1755298723851",
      "user_name": "pc",
      "rating": 5,
      "title": "",
      "review_body": "works for me For me, this floss is the perfect thickness. For me, this floss is the perfect thickness. It is strong and does not fray. There is no flavour, which is no bad thing. Happy that it is relatively more environmentally friendly than most other flosses. Could be improved by providing an option for a glass dispenser, but I am just as happy to do without one. Less is more. I would buy it again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-12-05T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "86",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-melodiehyams-1755298723851",
      "user_name": "Melodie Hyams",
      "rating": 4,
      "title": "",
      "review_body": "Almost perfect eco floss I decided to try eco floss to reduce my personal plastic 'footprint'. I decided to try eco floss to reduce my personal plastic 'footprint'. I've been using FLON for over a year now. It's good but just a little more breakable than standard (non-eco) floss and not as 'silky' as I would like. Having said that, there is always one area of my mouth where it breaks, due to a tight squeeze and a sharpish tooth, so that may not be an issue for others. I'd prefer a little more pepermint taste, there's very little, if any. For perfection, an indication of where to cut it for the ideal length would be useful. I often feel I've been excessive but it's quite difficult to judge, so I err on too much which is not ideal for my waste reduction aspirations! I've decided to have a whirl with the EcoYou Bamboo Charcoal Dental Floss. I don't really like the idea of black floss but if it's less breakable that would be preferable. So those are the pros and cons from my perspective. In spite of the quibbles, I would still recommend it. You really just need to try it for yourself...",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2023-08-28T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "87",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-fh-1755298723851",
      "user_name": "F H.",
      "rating": 4,
      "title": "",
      "review_body": "Good Good although too pricey. Good although too pricey. Much more effective than other standard flossing it doesn't shred your gums more gentle.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-07-28T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "88",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-crowolf-1755298723851",
      "user_name": "Crowolf",
      "rating": 5,
      "title": "",
      "review_body": "This doesn't break between your teeth. Unlike other well-known and more expensive makes of fluoride free dental floss this does not snap off between your teeth and if like me you have teeth that are close together finding a floss that doesn't break can turn into an online quest. Unlike other well-known and more expensive makes of fluoride free dental floss this does not snap off between your teeth and if like me you have teeth that are close together finding a floss that doesn't break can turn into an online quest. As this dental floss is made out of silk it slides between the teeth with comfort and has a nice taste to it too. The silk is harvested humanely and to me seems the best medium for the job.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-12-02T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "89",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-andrewandandrewswife-1755298723852",
      "user_name": "Andrew and Andrew's Wife",
      "rating": 5,
      "title": "",
      "review_body": "Does the job it is designed for. I have teeth that are very close together but this gets between them and flosses well. I have teeth that are very close together but this gets between them and flosses well. You need to pull a fair amount off and warp around your fingers and be gentle as you floss but if you get the knack of it, one strand will work for the whole mouth. I will be buying this product regularly from now on.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2023-07-12T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "90",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-lou-1755298723852",
      "user_name": "Lou",
      "rating": 5,
      "title": "",
      "review_body": "Great. Been using these for years, they are great and do the job. Been using these for years, they are great and do the job.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-06-15T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "91",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-kittycat-1755298723852",
      "user_name": "KittyCat",
      "rating": 5,
      "title": "",
      "review_body": "Excellent eco floss! I never thought about an ‘eco’ dental floss until I saw them on here - I’m so glad I bought it! I never thought about an ‘eco’ dental floss until I saw them on here - I’m so glad I bought it! After looking at other brands which weren’t 100% biodegradable, this brand seemed to be a lot better and honest (from what I’ve read...). The floss worked a lot better than I thought and didn’t break off while flossing. Didn’t even break when flossing awkward back teeth. Definitely recommend and I love that there are refills. So much better for the ocean and planet! The glass jar is small, so easy to store too.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-25T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "92",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-stephl-1755298723852",
      "user_name": "Steph L",
      "rating": 5,
      "title": "",
      "review_body": "Great quality floss I recently ordered this product to see what it was like as I am trying to limit the amount of single use plastic I use. I recently ordered this product to see what it was like as I am trying to limit the amount of single use plastic I use. The mint flavour is quite subtle, which I like, and it the floss itself is much stronger than the previous eco-friendly flosses I have used with no breakage when getting those back teeth! Delivery was pretty quick given the current Covid delays and the packaging is really cute. I will definitely order again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-05-10T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "93",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-jocelyn-1755298723852",
      "user_name": "Jocelyn",
      "rating": 5,
      "title": "",
      "review_body": "works well very smooth and easy to use , easy to open also very smooth and easy to use , easy to open also",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-01-25T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "94",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-kf-1755298723852",
      "user_name": "Kf",
      "rating": 5,
      "title": "",
      "review_body": "Great value Very impressed with this, both for value and quality. Very impressed with this, both for value and quality. Always buy this.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2023-09-09T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "95",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-ssayers-1755298723852",
      "user_name": "S Sayers",
      "rating": 4,
      "title": "",
      "review_body": "Comfortable to use but prone to breaking Comfortable to use but prone to breaking",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-22T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "96",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-eleanorharrison-1755298723852",
      "user_name": "Eleanor Harrison",
      "rating": 5,
      "title": "",
      "review_body": "Eco dental floss.....does what it says on the tin! Very nice product - arrived quickly. Very nice product - arrived quickly. I wasn't totally sure if the cutting mechanism would work as I tried one before that was rubbish - but this one works a treat. Really happy to have replaced another bit of bathroom plastic with an eco version. thanks!!",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-05-03T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "97",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-amazoncustomer-1755298723852",
      "user_name": "Amazon Customer",
      "rating": 5,
      "title": "",
      "review_body": "It's good product It's really good. It's really good. Bit expensive but quality is good.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-11-21T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "98",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-cleocheong-1755298723852",
      "user_name": "Cleo Cheong",
      "rating": 5,
      "title": "",
      "review_body": "Smells fresh, cleans well. Arrived within 3 days and delivered by Royal mail. Arrived within 3 days and delivered by Royal mail. Love the peppermint oil flavour - smells fresh! But most importantly the floss cleans well. The thread is not too thin nor too thick, just perfect. Customer image Customer image",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-10-28T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "99",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-birdy-1755298723852",
      "user_name": "Birdy",
      "rating": 5,
      "title": "",
      "review_body": "Lovely 👍🏼 My teeth are very close together, yet this waxed floss gets to all the tricky places. My teeth are very close together, yet this waxed floss gets to all the tricky places. It’s also minty, so leaves a fresh flavour in the mouth. Pleasantly surprised.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-11T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "100",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-judyc-1755298723853",
      "user_name": "judyc",
      "rating": 5,
      "title": "",
      "review_body": "I can’t believe it’s not plastic Very strong yet gentle floss. Very strong yet gentle floss. Doesn’t shred like another plastic free floss I tried. Thicker than my previous alternative too yet glides more easily between very tight teeth.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-01-20T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "101",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-sarainhove-1755298723853",
      "user_name": "sarainhove",
      "rating": 5,
      "title": "",
      "review_body": "Less plastic I will keep buying this. I will keep buying this. Doesn't fray or break easy and the fewer plastic boxes i have to throw away the better.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-05-25T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "102",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-amybowen-1755298723853",
      "user_name": "Amy Bowen",
      "rating": 5,
      "title": "",
      "review_body": "Great product Lovely dental floss, has a nice feel and scent to it. Lovely dental floss, has a nice feel and scent to it. Love the glass bottle it comes in too. Would buy again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-16T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "103",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-lynseymcinnes-1755298723853",
      "user_name": "Lynsey McInnes",
      "rating": 5,
      "title": "",
      "review_body": "Delicious and sustainable. Yay! Loved my new floss from Flon. Loved my new floss from Flon. Cute and sustainable packaging, smelt and tasted delicious and did the job well. I'll definitely be buying again.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-11-06T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "104",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-reportpage5bdw-1755298723853",
      "user_name": "Report page 5:\tBDW",
      "rating": 5,
      "title": "",
      "review_body": "Does the job Doesn’t break as easily as some other natural fibre floss - or I’ve learnt how to use them now! Doesn’t break as easily as some other natural fibre floss - or I’ve learnt how to use them now!",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-08-24T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "105",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-judith-1755298723853",
      "user_name": "Judith",
      "rating": 5,
      "title": "",
      "review_body": "Will buy again Doesn't snap like other brands. Doesn't snap like other brands. Eco packaging and easy refill",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-03-18T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "106",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-poppets-1755298723853",
      "user_name": "Poppets",
      "rating": 5,
      "title": "",
      "review_body": "Good buy. Ideal product. Ideal product. Very nice to use.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-07-10T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "107",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-jlbaxter-1755298723853",
      "user_name": "J L Baxter",
      "rating": 5,
      "title": "",
      "review_body": "Great floss Great. Great. Easy to floss with this product.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-01-10T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "108",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-lukevandenhoven-1755298723853",
      "user_name": "Luke van den Hoven",
      "rating": 4,
      "title": "",
      "review_body": "Great alternative Easy to use floss, seems to do the job. Easy to use floss, seems to do the job. Like many other eco floss it does snap quite easily.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-12-03T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "109",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-jess-1755298723853",
      "user_name": "Jess",
      "rating": 5,
      "title": "",
      "review_body": "Best ecofriendly floss! Very happy!! Very happy!! 😀 We have tried a few ecofriendly floss without success until now, this is the best one. It goes between the teeth easily. I will definitely buy it again!!! Report page 6:From United Kingdom",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2021-09-02T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "110",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-ab-1755298723853",
      "user_name": "AB",
      "rating": 5,
      "title": "",
      "review_body": "Would buy again Over all a great product. Over all a great product. Rips easily, but that's only a small problem. Most important is, that it's eco friendly and I don't have to change my dental hygiene routine.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-10-10T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "111",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-lenalo-1755298723853",
      "user_name": "Lena Lo",
      "rating": 5,
      "title": "",
      "review_body": "Plastic free floss that doesn't break - and doesn't break the bank! I am trying to reduce my plastic waste and came across this brilliant little product: floss made out of (ethically sourced) silk in a cute glass container. I am trying to reduce my plastic waste and came across this brilliant little product: floss made out of (ethically sourced) silk in a cute glass container. I was a bit worried at first whether it would have the same strength as standard plastic floss, but am glad to say that it's standing up very well to my rigorous flossing. The texture of the floss is a bit uneven but I think this actually helps its purpose. I found getting the first bit of floss through the cutting mechanism a bit fiddly but haven't had any issues since then. It's cute, it's functional, it's ethical and it's well-priced.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2020-11-16T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "112",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-lenjane-1755298723853",
      "user_name": "Lenjane",
      "rating": 5,
      "title": "",
      "review_body": "Great Eco slyrrnstive Good value eco product to cut down in plastic floss From other countries Good value eco product to cut down in plastic floss From other countries",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2022-09-05T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "113",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-mircolami-1755298723853",
      "user_name": "Mirco Lami",
      "rating": 5,
      "title": "",
      "review_body": "Recensione filo [Translated] Excellent floss; good abrasion resistance; doesn’t break even when reused. [Translated] Excellent floss; good abrasion resistance; doesn’t break even when reused.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-01-26T00:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "114",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-amel-1755298723853",
      "user_name": "Amel",
      "rating": 5,
      "title": "",
      "review_body": "Parfait [Translated] Perfect. [Translated] Perfect.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-06-21T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "115",
      "product_id": "61b4115d1078bd01333c3132",
      "user_id": "amazon-josephinelegrand-1755298723853",
      "user_name": "Josephine Legrand",
      "rating": 4,
      "title": "",
      "review_body": "Bonne alternative écologique à un fil dentaire comme Reach par Johnson [Translated] I adopted this floss to reduce plastic waste; quality similar to my usual; looks nice; minor issue: end of thread slips back into the bottle. [Translated] I adopted this floss to reduce plastic waste; quality similar to my usual; looks nice; minor issue: end of thread slips back into the bottle.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2024-08-31T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    },
    {
      "id": "116",
      "product_id": "6691a9fd1034680012078368",
      "user_id": "amazon-josephinelegrand-1755298723853",
      "user_name": "Josephine Legrand",
      "rating": 5,
      "title": "",
      "review_body": "Pratique, joli et écolo [Translated] Works as well or better than standard floss; compact and pretty glass bottle. [Translated] Works as well or better than standard floss; compact and pretty glass bottle. This is the refill.",
      "status": "approved",
      "is_verified_purchase": true,
      "created_at": "2025-05-11T23:00:00.000Z",
      "updated_at": "2025-08-15T23:16:41.715Z",
      "helpful_count": 0,
      "images": []
    }
  ],
  "nextId": 117
}